// 3. Какой результат будет у выражений ниже?

"" + 1 + 0 // "10"
"" - 1 + 0 // -1
true + false // 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" // "9px"
"$" + 4 + 5 // "$45"
"4" - 2 // 2
"4px" - 2 // NaN
"  -9  " + 5 // "  -9  5"
"  -9  " - 5 // -14
null + 1 // 1
undefined + 1 // NaN
" \t \n" - 2 // -2


/* 4. Ниже приведён код, который запрашивает у пользователя два числа и показывает их сумму.
 Он работает неправильно. Код в примере выводит 12 (для значения полей по умолчанию).
 В чём ошибка? Исправьте её. Результат должен быть 3. */

let a = prompt("Первое число?", 1);
let b = prompt("Второе число?", 2);

alert(a + b); // 12

// Нам нужно привести строки к числам перед применением оператора +. Например, с помощью Number() или вставки + перед ними.

// let a = +prompt("Первое число?", 1);
// let b = +prompt("Второе число?", 2);

// alert(a + b); // 3

// или

// let a = prompt("Первое число?", 1);
// let b = prompt("Второе число?", 2);

// alert(+a + +b); // 3